app/controllers/efforts_controller.rb

SELECT * FROM `efforts`
---
  def index
    @efforts = Effort.all

SELECT * FROM `efforts` WHERE (`efforts`.`id` = 0)
---
  def show
    helper 1
    @effort = Effort.find(params[:id])

SELECT * FROM `efforts` WHERE (`efforts`.`id` = 2)
SELECT * FROM `users`
SELECT * FROM `tasks`
---
  def edit
    @effort = Effort.find(params[:id])
    helper 0
    @users = Users.find(:all)
    @tasks = Tasks.find(:all)

    @userOptions2 = Hash.new
    @taskOptions2 = Hash.new


      @users.each do |var|
        @userOptions2.store(var.id, var.user_name)
      end

      @tasks.each do |var|

INSERT INTO `efforts` (`user_id`, `task_id`, `created_at`, `updated_at`, `task_date`) VALUES(1, 1, '2014-05-01 12:53:05', '2014-05-01 12:53:05', NULL)
---
  def create
    @effort = Effort.new(params[:effort])
    datehash = params[:taskDate]
    @effort.task_date = Date.parse(datehash["taskDate(1i)"].to_s+'-'+datehash["taskDate(2i)"].to_s+'-'+datehash["taskDate(3i)"].to_s)

    respond_to do |format|
      if @effort.save

SELECT * FROM `efforts` WHERE (`efforts`.`id` = 4)
UPDATE `efforts` SET `user_id` = 1, `task_id` = 3, `updated_at` = '2014-05-03 14:23:28' WHERE `id` = 4
---
  def update
    @effort = Effort.find(params[:id])

    respond_to do |format|
      if @effort.update_attributes(params[:effort])

SELECT * FROM `efforts` WHERE (`efforts`.`id` = 1)
DELETE FROM `efforts` WHERE `id` = 1
---
  def destroy
    @effort = Effort.find(params[:id])
    @effort.destroy